**Examples**

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({"name": ['Superman', 'Batman', 'Spiderman'],
                   "toy": [np.nan, 'Batmobile', 'Spiderman toy'],
                   "born": [pd.NaT, pd.Timestamp("1956-06-26"),
                            pd.NaT]})
df

        name            toy       born
0   Superman            NaN        NaT
1     Batman      Batmobile 1956-06-26
2  Spiderman  Spiderman toy        NaT

<img src="https://www.w3resource.com/w3r_images/pandas-dataframe-dropna.png" alt="Pandas: DataFrame-dropna" title="Title text" height="" width="" />

Drop the rows where at least one element is missing:

In [3]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1956-06-26

<img src="https://www.w3resource.com/w3r_images/pandas-dataframe-dropna-1.png" alt="Pandas: DataFrame - Drop the rows where at least one element is missing." title="Title text" height="" width="" />

Drop the columns where at least one element is missing:

In [4]:
df.dropna(axis='columns')

        name
0   Superman
1     Batman
2  Spiderman

<img src="https://www.w3resource.com/w3r_images/pandas-dataframe-dropna-2.png" alt="Pandas: DataFrame - Drop the columns where at least one element is missing." title="Title text" height="" width="" />

Drop the rows where all elements are missing.

In [5]:
df.dropna(how='all')

        name            toy       born
0   Superman            NaN        NaT
1     Batman      Batmobile 1956-06-26
2  Spiderman  Spiderman toy        NaT

<img src="https://www.w3resource.com/w3r_images/pandas-dataframe-dropna-3.png" alt="Pandas: DataFrame - Drop the rows where all elements are missing." title="Title text" height="" width="" />

Keep only the rows with at least 2 non-NA values:

In [6]:
df.dropna(thresh=2)

        name            toy       born
1     Batman      Batmobile 1956-06-26
2  Spiderman  Spiderman toy        NaT

<img src="https://www.w3resource.com/w3r_images/pandas-dataframe-dropna-4.png" alt="Pandas: DataFrame - Keep only the rows with at least 2 non-NA values." title="Title text" height="" width="" />

Define in which columns to look for missing values:

In [7]:
df.dropna(subset=['name', 'born'])

     name        toy       born
1  Batman  Batmobile 1956-06-26

<img src="https://www.w3resource.com/w3r_images/pandas-dataframe-dropna-5.png" alt="Pandas: DataFrame - Define in which columns to look for missing values." title="Title text" height="" width="" />

Keep the DataFrame with valid entries in the same variable:

In [8]:
df.dropna(inplace=True)
df

     name        toy       born
1  Batman  Batmobile 1956-06-26

<img src="https://www.w3resource.com/w3r_images/pandas-dataframe-dropna-6.png" alt="Pandas: DataFrame - Keep the DataFrame with valid entries in the same variable." title="Title text" height="" width="" />